tests/taurus-tests/tests/localhost-frontpage-robot.yaml
settings:
  artifacts-dir: test-results/%Y-%m-%d_%H-%M-%S.%f

execution:
- executor: robot
  concurrency: 10
  hold-for: 30s
  scenario: 
    script: tests/test.robot
- executor: robot
  concurrency: 10
  hold-for: 30s
  scenario: 
    script: tests/test.robot
- executor: robot
  concurrency: 10
  hold-for: 30s
  scenario: 
    script: tests/test.robot
- executor: robot
  concurrency: 10
  hold-for: 30s
  scenario: 
    script: tests/test.robot
- executor: robot
  concurrency: 10
  hold-for: 30s
  scenario: 
    script: tests/test.robot
- executor: robot
  concurrency: 10
  hold-for: 30s
  scenario: 
    script: tests/test.robot
- executor: robot
  concurrency: 10
  hold-for: 30s
  scenario: 
    script: tests/test.robot